# однострочный комментарий
# Ctrl + / - сочетание клавиш для однострочного комментария

'''
многострочный 
комментарий
'''

"""
многострочный
комментарий
"""

# переменные
# = - оператор присовения
# snake_case (змеиная нотация) - в названиях используется нижнее подчекривание "_"
var_1 = 10 # объявили переменную и присвоили целое значение
my_var = 2354 

# camelСase (верблюжая нотация) - это когда второе и последеющее слово 
# в названии начинаются с заглавных букв
var2 = 20 # пример camelCase
myNamberVar = 2354 # пример camelCase

# константа (константная переменная)
CONST_VAR = 9.8 # КОНСТАНТУ пишут заглавными буквами

# Ctrl + j - терминал
# функция печати (вывода) в терминал 
# print(var_1)
# print(CONST_VAR)

# несколько знгачений в одну строку
# print(var_1, var2, myNamberVar)

# функция ввода из терминала
in_1 = input("введите первое число: ")
in_2 = input("введите второе число: ")

# конкатенация строк
# result = in_1 + in_2

# арифметическое сложение
result = int(in_1) + int(in_2)

print(result)

